**4.9. Intro to Data Visualization with Python**

Content:
- #01 Task 3 Importing libraries and datasets
- #02 Task 4 Wrangle the data
- #03 Task 5 Complete data quality and consistency checks
- #04 Task 6 Combine the customer data with the main prepared data
- #05 Task 8 Export the dataframe as a pickle file

***

#01 **Task 3** - Importing libraries and datasets

***

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#set path
path=r'C:\Users\EliteMini HX90\OneDrive\Documents\CareerFoundry\Instacart Project Analysis'

In [3]:
#import dataset
df_cust = pd.read_csv(os.path.join(path,'02_Data','01_Original_Data','customers.csv'),index_col=False)

In [4]:
#import dataset
ords_prods_merge = pd.read_pickle(os.path.join(path,'02_Data','02_Prepared_Data','20231107_orders_products_merged.pkl'))

***

#02 **Task 4** - Wrangle the data

***

In [5]:
#check data
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [31]:
df_cust.shape

(206209, 10)

In [6]:
#rename columns for consistency purposes
df_cust.rename(columns = {'First Name' : 'first_name','Surnam':'surname','Gender':'gender','STATE':'state','Age':'age'}, inplace = True)

In [7]:
#check data
df_cust.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#check data types
df_cust.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
#change data type of user_id to sring
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [10]:
#check data type
df_cust['user_id'].dtype

dtype('O')

***

#03**Task 5** - Data Consistency Checks

***

In [11]:
#checking for mixed-type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\EliteMini HX90\AppData\Local\Temp\ipykernel_27728\3291424869.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)

In [12]:
#convert column with mixed data types to string
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [13]:
#check data type
df_cust['first_name'].dtype

dtype('O')

In [14]:
#check for missing values
df_cust.isnull().sum()

user_id         0
first_name      0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [15]:
#check for duplicates
df_cust_dups = df_cust[df_cust.duplicated()]
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

***

#04**Task 6** - Combine the customer data with the rest of the prepared data

***

In [16]:
#check data type of user_id in prepared data
ords_prods_merge['user_id'].dtype

dtype('int64')

In [17]:
#change data type of user_id to string
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [18]:
#check data type of user_id in prepared data
ords_prods_merge['user_id'].dtype

dtype('O')

In [19]:
#check data type
df_cust['user_id'].dtype

dtype('O')

In [20]:
#check column names of merged df 
column_names_ords_prods = list(ords_prods_merge.columns.values)
column_names_ords_prods

['product_id',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 'order_id',
 'user_id',
 'order_number',
 'orders_day_of_week',
 'order_hour_of_day',
 'days_since_prior_order',
 'add_to_cart_order',
 'reordered',
 '_merge',
 'price_label',
 'busiest_day',
 'busiest_days',
 'busiest_period_of_day',
 'max_order',
 'loyalty_flag',
 'avg_price',
 'spending_flag',
 'median_days_since_order',
 'frequency_flag']

In [21]:
#delete leftover indicator from previous merges
ords_prods_merge = ords_prods_merge.drop(columns=['_merge'])

In [22]:
#check column names of merged df 
column_names_ords_prods = list(ords_prods_merge.columns.values)
column_names_ords_prods

['product_id',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 'order_id',
 'user_id',
 'order_number',
 'orders_day_of_week',
 'order_hour_of_day',
 'days_since_prior_order',
 'add_to_cart_order',
 'reordered',
 'price_label',
 'busiest_day',
 'busiest_days',
 'busiest_period_of_day',
 'max_order',
 'loyalty_flag',
 'avg_price',
 'spending_flag',
 'median_days_since_order',
 'frequency_flag']

In [23]:
#merge dataframes
ords_prods_new_merge = ords_prods_merge.merge(df_cust, on = 'user_id', indicator = True)

In [24]:
#check df
ords_prods_new_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both

In [25]:
#check value counts
ords_prods_new_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [26]:
#delete indicator column because it is no longer necessary
ords_prods_new_merge = ords_prods_new_merge.drop(columns=['_merge'])

In [27]:
#check column names of new merged df 
column_names_new_ords_prods = list(ords_prods_new_merge.columns.values)
column_names_new_ords_prods

['product_id',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 'order_id',
 'user_id',
 'order_number',
 'orders_day_of_week',
 'order_hour_of_day',
 'days_since_prior_order',
 'add_to_cart_order',
 'reordered',
 'price_label',
 'busiest_day',
 'busiest_days',
 'busiest_period_of_day',
 'max_order',
 'loyalty_flag',
 'avg_price',
 'spending_flag',
 'median_days_since_order',
 'frequency_flag',
 'first_name',
 'surname',
 'gender',
 'state',
 'age',
 'date_joined',
 'n_dependants',
 'fam_status',
 'income']

In [28]:
#check shape
ords_prods_new_merge.shape

(32404859, 32)

***

#05 **Task 8** - Export the dataframe as a pickle file

***

In [29]:
#export to pickle
ords_prods_new_merge.to_pickle(os.path.join(path, '02_Data','02_Prepared_Data', '20231107_orders_products_merged_new.pkl'))

In [30]:
#export to csv
df_cust.to_csv(os.path.join(path,'02_Data','02_Prepared_Data','customers_checked.csv'), index=False)